---
title: ImagePlacementOptions
classe: Autodesk.Revit.DB.ImagePlacementOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ImagePlacementOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `imagePlacementOptions.IsValidObject` | Boolean |
| `XYZ Location { get; set; }` | `imagePlacementOptions.Location` | XYZ |
| `BoxPlacement PlacementPoint { get; set; }` | `imagePlacementOptions.PlacementPoint` | BoxPlacement |
| `Void Dispose()` | `imagePlacementOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```